# Stone Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stone Class
Members See Also
---
A static class that provides access to the property names that appear in the Stone visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class Stone
```

Visual Basic
---
```text
Public NotInheritable Class Stone
```

Visual C++
---
```text
public ref class Stone abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..Stone
# See Also
Stone Members
Autodesk.Revit.DB.Visual Namespace